In [ ]:
=============================EDA===================================================
1) Pandas           :  Dataframe or data applications
2) numpy            :  Numerical python for math operations
3) matplotlib       :  For plots graphs
4) seaborn          :  For plots graphs
5) Bokhe            :  For Plots
6) Plotly           :  For Plots
============================Machine learning=========================================

7) Scikit learn(Sklearn)     : ML Models
8) Stats                     : Stastistical models

==============================Data retrival From sql Scrapping=========================
9) Sqlite           : connect with database
10) Beautiful soup  : scrap the data from website
11) websocket       : Scrap

============================== Deep learning/Computer Vision=========================
12) Tensorflow      : Google
13) Keras           : DL Models
14) OpenCv          : Image operations
15) Pillow(pil)     : Image operations
16) Pytorch         : Facebook
17) pretrained model
   VGG16
   Mobilent
   RESNET
   RCNN
   MASKRCN
   FASTERCNN
   YOLO

=====================================Natural lamguage process=======================

18) NLTK                : Natural language process
19) Scipy               :
20) word2vec( How words will convert into vector):
21) Glove
22) Wordcloud

==========================================Hugging face============================
23) Transformers : BERT
=======================================GenAI models=========================
24) OpenAI+Microsoft     : GPT(models)
25) Google               : Gemini
26) Amazon               : Q
27) Meta Facebook        : metaAi 
28) Apple                : 

LLAMA
GEMMA
Dalle-E
Ts
All ARE HAVING DIFFERENT  DIFFERENT PACAGES

====================LANGCHAIN===============
29) Langchain Framework
=========================Deployments/applications
30) Flask
31) Streamlit
32) Django

============MLops======
33) MIflow
34) Kubeflow
35) Azure Ai services : azure packages
36) GCP: GCP packages

**step1** 
Createa DataFrame

- we will create a dataframe using list
- we will create a dataframe using dictionary

In [3]:
import pandas as pd

In [5]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [6]:
type(d1)

pandas.core.frame.DataFrame

**step-2**

**Provide the data**

In [4]:
import pandas as pd

In [5]:
names=['tarun','surendar','mohit']
pd.DataFrame(names)

          0
0     tarun
1  surendar
2     mohit

In [6]:
import pandas as pd

In [7]:
names=['tarun','surendar','mohit']
age=[20,21,22]
data=zip(names,age)
pd.DataFrame(data)

          0   1
0     tarun  20
1  surendar  21
2     mohit  22

In [8]:
names=['kajal','kristy','tanya']
age=[20,21,22]
city=['Hyd','ECIL','Blr']
pd.DataFrame(zip(names,age,city))

        0   1     2
0   kajal  20   Hyd
1  kristy  21  ECIL
2   tanya  22   Blr

**step-3 Provide the column names**

In [9]:
names=['kajal','kristy','tanya']
age=[20,21,22]
pd.DataFrame(names,
             columns=['Names'])

    Names
0   kajal
1  kristy
2   tanya

In [10]:
names=['kajal','kristy','tanya']
age=[20,21,22]
pd.DataFrame(zip(names,age),
             columns=['Names','age'])

    Names  age
0   kajal   20
1  kristy   21
2   tanya   22

In [11]:
names=['kajal','kristy','tanya']
age=[20,21,22]
city=['Hyd','ECIL','BLR']
data=zip(names,age,city)
cols=['Names','Age','City']
pd.DataFrame(data,columns=cols)

    Names  Age  City
0   kajal   20   Hyd
1  kristy   21  ECIL
2   tanya   22   BLR

**step4**

  **Providing index**

In [12]:
names=['kajal','kristy','Tanya']
age=[20,21,22]
city=['Hyd','ECIL','Blr']
data=zip(names,age,city)
ix=['A','B','C']
cols=['Names','Age','City']

pd.DataFrame(data,
            index=ix,
            columns=cols)

    Names  Age  City
A   kajal   20   Hyd
B  kristy   21  ECIL
C   Tanya   22   Blr

In [2]:
import pandas as pd

In [13]:
names=['kajal','kristy','tanya']
pd.DataFrame(names)

names=['kajal','kristy','tanya']
pd.DataFrame(names,columns=['Names'])

# why names is passing in list Format if we have 1 column only
##############################################################
names=['kajal','kristy','tanya']
age=[20,21,22]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])
###########################################################
names=['kajal','kristy','tanya']
age=[20,21,22]
city=['Hyd','ECIL','Blr']

data=zip(names,age,city)

cols=['Names','Age','City']
pd.DataFrame(data,columns=cols)

    Names  Age  City
0   kajal   20   Hyd
1  kristy   21  ECIL
2   tanya   22   Blr

In [14]:
name=['kajal','kristy','tanya']
age=[20,35,12]
city=['Hyd','Blr','Chn']
data=zip(name,age)
column=['Name','Age']
df=pd.DataFrame(data, index=city, columns=column)
df

       Name  Age
Hyd   kajal   20
Blr  kristy   35
Chn   tanya   12

- create a dataframe
  
- provide the data

- add the columns

- provide the column names

- provide the index

In [15]:
import pandas as pd

In [16]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

**step no 5**

**Add a new column on exsiting new dataFrame**

In [17]:
# Create  a dataframe
# Name
# age
# city
import pandas as pd

names=['kajal','kristy','tanya']
age=[20,21,22]
city=['blr','hyd','delhi']
data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)
df

    Names  Age   City
0   kajal   20    blr
1  kristy   21    hyd
2   tanya   22  delhi

- if you went to add a new column

- first check how many roes are there

- For example in above dataframe we have 3 rows

- your new column also should have 3 rows

- suppose i went to create a new column: salary

- make a list with 3 values

- salary =[100000,200000,300000]

- syntax:dataframe[column]=list of values

- salary=[100000,200000,300000]

- df['salary']=salary

In [20]:

salary=[10000,20000,30000]
df['salary']=salary
df

    Names  Age   City  salary
0   kajal   20    blr   10000
1  kristy   21    hyd   20000
2   tanya   22  delhi   30000

**use case -1**

- create empty data frame first

- create 3 list using list comprehension

- list1= a values from 1 to 10

- list2= suare of 1 to 10

- list3= cube of 1 to 10

- finally make a dataframe

In [21]:
import pandas as pd
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [22]:
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
df1['X']=l1
df1['Y']=l2
df1['Z']=l3
df1

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

**step-6**

**update the already existed column**

- create a new column

  - creating a new list salary=[1000,2000,3000]

  - df['S']

  - creating new column the column name is our choice

- update existing column are same way only

  - here also we need a make a list of values=number of rows

  - while updating the existing column

  - we need to provide already existed column name only

  - df['z']= list of values

In [23]:
import pandas as pd
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [24]:
# **** dataFrame name: df1
# list of values variable name: z
# which column we want to update:z'
z=[i**4 for i in range(1,10)]
df1['Z']=z
df1

      Z
0     1
1    16
2    81
3   256
4   625
5  1296
6  2401
7  4096
8  6561

In [6]:
df2=pd.DataFrame()          # use list comprehension to 
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range (1,10)]

df2['Number']=l1
df2['Square']=l2
df2['Cube']=l3

df2

   Number  Square  Cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

**step-7**

**Drop the column**

In [25]:
# How to check the columns
df1.columns

Index(['Z'], dtype='object')

- if you want to drop a specific column

- we will use drop method

- we already know about difference between keywords and methods

- keywords will use directly

- method will use with corresponding dataframe

- Method name: drop

df1.drop()

  - column: which column you want to drop

  - asis: Represents the specified value is a row or column

      - axis=0 means rows

      - axis=1 means column

      - by default axis =0

- inplace: will provide overwrite the dataframe or not 

   - inplace= True, this indicates overwrite the dataframe

   - inplace= False, this indicates the modified dataframe will be use when you provide new variables for the operations

In [27]:
df1.drop('x')
# we are not providing axis
# if assuming the provide value is a raw
# by default axis=0=====rows

KeyError: "['x'] not found in axis"

In [30]:
df2.drop('X',axis=1)

# after this in a new cell type df1
# you will see original dataframe 
# becouse we did not provide inplace
#If you want to use below output 
# you need to assign a variable
# df-new=df1.drop('X', axis=1)

NameError: name 'df2' is not defined

In [33]:
df2.drop('X',axis=1,inplace=True)
df2

NameError: name 'df2' is not defined